
## Plan Result (dev/databases)

[CI link](https://github.com/tqer39/edu-quest/actions/runs/18629859742)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.cf_app_resources.cloudflare_d1_database.app


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cf_app_resources.cloudflare_d1_database.app will be created
  + resource "cloudflare_d1_database" "app" {
      + account_id       = "3c9a0adf6781e171e263a64f78c41ec4"
      + created_at       = (known after apply)
      + file_size        = (known after apply)
      + id               = (known after apply)
      + name             = "edu_quest_dev_db"
      + num_tables       = (known after apply)
      + read_replication = {
          + mode = "disabled"
        }
      + uuid             = (known after apply)
      + version          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + d1_database             = {
      + id   = (known after apply)
      + name = "edu_quest_dev_db"
    }
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-dev","PRNumber":103,"Program":"tfcmt","SHA1":"0332864bbae1380c569358200304c0e0ff022b3c","Target":"dev/databases","Vars":{},"WorkflowName":"Terraform - dev"} -->